---
kind: method
id: M:Autodesk.Revit.DB.ExternalGeometryId.op_Inequality(Autodesk.Revit.DB.ExternalGeometryId,Autodesk.Revit.DB.ExternalGeometryId)
source: html/0966c4df-2bbd-57c9-4b46-313ad41e3bda.htm
---
# Autodesk.Revit.DB.ExternalGeometryId.op_Inequality Method

Determines whether two ExternalGeometryIds are different.

## Syntax (C#)
```csharp
public static bool operator !=(
	ExternalGeometryId first,
	ExternalGeometryId second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.ExternalGeometryId`) - The first ExternalGeometryId.
- **second** (`Autodesk.Revit.DB.ExternalGeometryId`) - The second ExternalGeometryId.

## Returns
True if the ExternalGeometryIds are different; otherwise, false.